
&После("ОбработкаПроведения")
Процедура СКМ_ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено( ЭтотОбъект.КартаЛояльности) Тогда
		ДатаРегистрацииДляКартыЛояльностиЗаполнить = ЭтотОбъект.КартаЛояльности.ПолучитьОбъект();
		Если 
			ДатаРегистрацииДляКартыЛояльностиЗаполнить.Владелец.Наименование = "Социальная Карта Москвича, все льготники" Тогда
			Если не ЗначениеЗаполнено(ДатаРегистрацииДляКартыЛояльностиЗаполнить.СКМ_ДатаРегистрации) 	Тогда	
				ДатаРегистрацииДляКартыЛояльностиЗаполнить.СКМ_ДатаРегистрации = ЭтотОбъект.Дата;
				ДатаРегистрацииДляКартыЛояльностиЗаполнить.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
